{
    "navbar": {
        "items": [
            {
                "caption": "Descrizione",
                "href": "#description",
                "class": "nav-link"
            },
            {
                "caption": "Materiale e strumenti",
                "href": "#materials",
                "class": "nav-link"
            },
            {
                "caption": "Preparazione",
                "href": "#preparation",
                "class": "nav-link"
            },
            {
                "caption": "Assemblaggio",
                "href": "#assembly",
                "class": "nav-link"
            },
            {
                "caption": "Utilizzo",
                "href": "#usage",
                "class": "nav-link"
            }
        ]
    },
    "sections": {
        "description": {
            "header": "Descrizione dello strumento",
            "images": [
                {
                    "src": "assets/images/schematic.jpg",
                    "text": "Questo strumento si basa sulla riproduzione del circuito proposto sulla rivista Nuova Elettronica (numero 212, kit LX1518) ma in versione SMD con componenti aggiornati. Permette di misurare la resistenza equivalente in serie dei condensatori elettrolitici per testare il loro stato di degradamento nel tempo."
                }
            ]
        },
        "materials": {
            "paragraphs": [
                {
                    "header": "Materiale necessario*",
                    "list": [
                        "elettronica: circuito preassemblato, interruttore, potenziometro, leds, snap per pila 9V;",
                        "un multimetro economico <b>modello YX-1000A</b> (reperibile nei negozi cinesi);",
                        "box realizzato in stampa 3D<b>**</b>;",
                        "viti per chiusura box (10 viti autofilettanti misura M2.3x6);",
                        "pila da 9V;"
                    ]
                },
                {
                    "header": "Strumenti",
                    "list": [
                        "saldatore per piccoli circuiti;",
                        "attrezzi vari: pinzette, spelafili, cacciavite;",
                        "seghetto manuale;"
                    ]
                },
                {
                    "subheader": "<br><h3>Note</h3><b>(*) è possibile acquistare il kit in varie versioni:</b>",
                    "list": [
                        "<span class=\"badge rounded-pill badge-bg-1\">opzione A</span>&nbsp;<b>solo elettronica:</b> vi verrà fornito unicamente il circuito stampato e i componenti accessori (leds, potenziometro, interruttore, snap per pila 9V), <b>escluso il multimetro YX-1000A</b>. Utile qualora vogliate usare un vostro box, o stamparvi da soli il box con la vostra stampante 3D, e disponete già del multimetro YX-1000A (o un altro milliamperometro);",
                        "<span class=\"badge rounded-pill badge-bg-2\">opzione B</span>&nbsp;<b>elettronica + box (kit fai-da-te):</b> tutta l'elettronica (circuito stampato, leds, potenziometro, interruttore, snap per pila 9V) e il box stampato in 3D <i>(assemblaggio fai-da-te)</i>;",
                        "<span class=\"badge rounded-pill badge-bg-3\">opzione C</span>&nbsp;<b>elettronica + box + multimetro YX-1000A (kit fai-da-te):</b> tutta l'elettronica (circuito stampato, leds, potenziometro, interruttore, snap per pila 9V), il box stampato in 3D, e il multimetro YX-1000A <i>(assemblaggio fai-da-te)</i>;",
                        "<span class=\"badge rounded-pill badge-bg-4\">opzione D</span>&nbsp;<b>strumento completo (preassemblato):</b> strumento pronto all'uso, già preassemblato nel box realizzato in stampa 3D, con incluso il milliamperometro;"
                    ],
                    "footer": "<b><i>In ogni caso, la pila 9V è esclusa</i></b>"
                },
                {
                    "subheader": "<br><b>(**) i files per la stampa 3D del box sono liberamente scaricabili da qui:</b><br><a class=\"btn btn-primary\" role=\"button\" href=\"/assets/files/esr_meter-box-model-20250720.zip\">Scarica files STL</a>"
                }
            ]
        },
        "preparation": {
            "header": "Preparazione",
            "steps": [
                {
                    "header": "prelievo delle parti necessarie dal tester",
                    "images": [
                        {
                            "src": "assets/images/preparation_01.jpg",
                            "text": "aprire il tester rimuovendo la vite posteriore"
                        },
                        {
                            "src": "assets/images/preparation_02.jpg",
                            "text": "staccare i due fili dello strumento dal circuito"
                        },
                        {
                            "src": "assets/images/preparation_03.jpg",
                            "text": "estrarre il circuito"
                        },
                        {
                            "src": "assets/images/preparation_04.jpg",
                            "text": "tagliare, con un seghetto, la parte superiore che contiene lo strumento, facendo attenzione ai fili"
                        },
                        {
                            "src": "assets/images/preparation_05.jpg",
                            "text": "particolare del taglio"
                        },
                        {
                            "src": "assets/images/preparation_06.jpg",
                            "text": "rimuovere le parti in plastica del vecchio alloggiamento batteria dal retro dello strumento"
                        },
                        {
                            "src": "assets/images/preparation_07.jpg",
                            "text": "segnare una striscia di 9mm nella parte inferiore del circuito"
                        },
                        {
                            "src": "assets/images/preparation_08.jpg",
                            "text": "tagliare, con un seghetto, la striscia inferiore del circuito"
                        },
                        {
                            "src": "assets/images/preparation_09.jpg",
                            "text": "particolare del circuito dopo il taglio"
                        },
                        {
                            "src": "assets/images/preparation_10.jpg",
                            "text": "dissaldare i due diodi, e saldare due fili sulle boccole dei puntali"
                        }
                    ]
                }
            ]
        },
        "assembly": {
            "header": "Assemblaggio",
            "steps": [
                {
                    "header": "1. montaggio delle boccole dei puntali",
                    "images": [
                        {
                            "src": "assets/images/assembly_01.jpg",
                            "text": "inserire la striscia di circuito stampato con le boccole nel box, spingendo le boccole nei fori fino ad arrivare a battuta con la plastica, quindi fissare l'angolare di blocco con due viti, facendo fuoriuscire i fili dalle due asole"
                        }
                    ]
                },
                {
                    "header": "2. montaggio dei componenti frontali",
                    "images": [
                        {
                            "src": "assets/images/assembly_02.jpg",
                            "text": "inserire l'interruttore di accensione e i due led. NOTA: uno dei led è provvisto di resistore, e va inserito nella boccola contrassegnata dalla scritta 'on'. <i>Opzionale: qualora i led non dovessero risultare bloccati nel loro alloggiamento, è possibile fissarli con una goccia di colla</i>"
                        },
                        {
                            "src": "assets/images/assembly_03.jpg",
                            "text": "saldare tre fili sui pin del potenziometro, fissarlo al frontale del box, e aggiungere la manopola"
                        },
                        {
                            "src": "assets/images/assembly_04.jpg",
                            "text": "aggiungere lo snap per la pila da 9V, tagliando il filo rosso in corrispondenza dell'interruttore, e saldarlo sui terminali"
                        }
                    ]
                },
                {
                    "header": "3. collegamenti al circuito",
                    "images": [
                        {
                            "src": "assets/images/pcb_connections.png",
                            "text": "dettaglio dei collegamenti"
                        },
                        {
                            "src": "assets/images/assembly_05.jpg",
                            "text": "saldare i fili del potenziometro al circuito sulle piazzole R21, seguendo lo schema in figura"
                        },
                        {
                            "src": "assets/images/assembly_06.jpg",
                            "text": "saldare i fili del led \"short\" sulle piazzole LED1 (rispettando la polarità) e i fili delle boccole dei puntali su CN2"
                        },
                        {
                            "src": "assets/images/assembly_07.jpg",
                            "text": "saldare insieme i due fili rossi e i due fili neri provenienti dalla batteria e dal led \"power\" sulle piazzole CN1, rispettando la polarità indicata"
                        },
                        {
                            "src": "assets/images/assembly_08.jpg",
                            "text": "saldare quindi i due fili provenienti dal milliamperometro su CN3"
                        }
                    ]
                },
                {
                    "header": "4. steps finali",
                    "images": [
                        {
                            "src": "assets/images/assembly_09.jpg",
                            "text": "fissare il circuito al box mediante 3 viti"
                        },
                        {
                            "src": "assets/images/assembly_10.jpg",
                            "text": "chiudere il coperchio posteriore con le quattro viti negli angoli, inserire la pila e chiudere il vano della pila con un'altra vite"
                        }
                    ]
                },
                {
                    "header": "5. risoluzione problemi",
                    "images": [
                        {
                            "src": "assets/images/assembly_11.jpg",
                            "text": "qualora, cortocircuitando i puntali, dovreste vedere la lancetta muoversi verso sinistra, vi basterà semplicemente invertire il collegamento dei due fili del milliamperometro sul circuito stampato"
                        },
                        {
                            "src": "assets/images/assembly_12.jpg",
                            "text": "tenendo cortocircuitati i puntali, e ruotando il potenziometro in senso orario, dovreste vedere la lancetta dello strumento spostarsi verso destra. Se la lancetta dovesse spostarsi verso sinistra, vi basterà invertire i collegamenti dei due pin esterni del potenziometro"
                        }
                    ]
                }
            ]
        },
        "usage": {
            "header": "Utilizzo dello strumento",
            "steps": [
                {
                    "header": "1. accendere lo strumento e calibrarlo",
                    "images": [
                        {
                            "src": "assets/images/usage_01.jpg",
                            "text": "tenendo i puntali in corto circuito, ruotare il potenziometro fino a portare la lancetta dello strumento sullo 0 (a destra)"
                        }
                    ]
                },
                {
                    "header": "2. effettuare la misura",
                    "subheader": "collegare i puntali ai reofori del condensatore. Minore sarà la resistenza misurata (lancetta tutta verso destra), maggiore sarà la qualità del condensatore. Nelle foto è mostrata una misurazione di un condensatore visibilmente danneggiato, e di uno nuovo.<br><b>NOTA: la misura può essere effettuata anche su condensatori saldati su circuito stampato (non è necessario rimuoverli).</b>",
                    "images": [
                        {
                            "src": "assets/images/usage_02.jpg",
                            "text": "<b>esempio di misura di un condensatore guasto</b>"
                        },
                        {
                            "src": "assets/images/usage_03.jpg",
                            "text": "<b>esempio di misura di un condensatore in ottimo stato</b>"
                        }
                    ]
                }
            ]
        }
    }
}